# Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного максимума)

# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]

list = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
max_number = int(input('Введите максимальное целое число: '))
min_number = int(input('Введите минимальное целое число: '))

print("Индексы элементов списка, значения которых принадлежат заданному диапазону: ", end="")
for i in range(len(list)):
    if list[i] <= max_number and list[i] >= min_number:
        print(i, end=", ")  
